Revit 2021.1 API
FabricationNetworkChangeService.SetGroupId Method
 Set the fabrication group identifier to change the elements to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2018.2
Syntax
C#
public void SetGroupId(
	int groupId
)
Visual Basic
Public Sub SetGroupId ( _
	groupId As Integer _
)
Visual C++
public:
void SetGroupId(
	int groupId
)
Parameters
groupId
Type: System.Int32
See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace